
let NameRus = [ 
   "Александр",
   "Алексей",
   "Альберт",
   "Анатолий",
   "Андрей",
   "Антон",
   "Аркадий",
   "Арсений",
   "Артём",
   "Артур",
   "Афанасий",
   "Богдан",
   "Борис",
   "Вадим",
   "Валентин",
   "Валерий",
   "Василий",
   "Виктор",
   "Виталий",
   "Владимир",
   "Владислав",
   "Всеволод",
   "Вячеслав",
   "Геннадий",
   "Георгий",
   "Глеб",
   "Григорий",
   "Даниил",
   "Демид",
   "Демьян",
   "Денис",
   "Дмитрий",
   "Евгений",
   "Егор",
   "Иван",
   "Игорь",
   "Илья",
   "Кирилл",
   "Константин",
   "Лев",
   "Леонид",
   "Макар",
   "Максим",
   "Матвей",
   "Михаил",
   "Никита",
   "Николай",
   "Олег",
   "Павел",
   "Пётр",
   "Родион",
   "Роман",
   "Руслан",
   "Савелий",
   "Святослав",
   "Семён",
   "Сергей",
   "Станислав",
   "Степан",
   "Тимофей",
   "Тимур",
   "Фёдор",
   "Эдуард",
   "Юрий",
   "Ян"
]

let Lastname=[
"Авдеев","Агапов","Агафонов","Агеев","Акимов","Аксёнов","Александров","Алексеев","Алёхин","Алешин","Алёшин","Ананьев","Андреев","Андрианов","Аникин","Анисимов","Анохин","Антипов","Антонов","Артамонов","Артёмов","Архипов","Астафьев","Астахов","Афанасьев","Бабушкин","Баженов","Балашов","Баранов","Барсуков","Басов","Безруков","Беликов","Белкин","Белов","Белоусов","Беляев","Беляков","Березин","Берия","Беспалов","Бессонов","Бирюков","Блинов","Блохин","Бобров","Богданов","Богомолов","Болдырев","Большаков","Бондарев","Борисов","Бородин","Бочаров","Булатов","Булгаков","Буров","Быков","Бычков","Вавилов","Васильев","Вдовин","Верещагин","Вешняков","Виноградов","Винокуров","Вишневский","Владимиров","Власов","Волков","Волошин","Воробьёв","Воронин","Воронков","Воронов","Воронцов","Второв","Высоцкий","Гаврилов","Гайдуков","Гакабов","Галкин","Герасимов","Гладков","Глебов","Глухов","Глушков","Гноев","Голиков","Голованов","Головин","Голубев","Гончаров","Горбань","Горбачав","Горбачёв","Горбунов","Гордеев","Горелов","Горлов","Горохов","Горшков","Горюнов","Горячев","Грачёв","Греков","Грибков","Грибов","Григорьев","Гришин","Громов","Губанов","Гуляев","Гуров","Гусев","Гущин","Давыдов","Данилов","Дашков","Дегтярев","Дегтярёв","Дементьев","Демидов","Дёмин","Демьянов","Денисов","Дмитриев","Добрынин","Долгов","Дорофеев","Дорохов","Дроздов","Дружинин","Дубинин","Дубов","Дубровин","Дьяков","Дьяконов","Евдокимов","Евсеев","Егоров","Ежов","Елизаров","Елисеев","Ельцин","Емельянов","Еремеев","Ерёмин","Ермаков","Ермилов","Ермолаев","Ермолов","Еромлаев","Ерофеев","Ерохин","Ершов","Ефимов","Ефремов","Жаров","Жданов","Жилин","Жириновский","Жуков","Журавлёв","Завьялов","Зайцев","Захаров","Зверев","Звягинцев","Зеленин","Зимин","Зиновьев","Злобин","Золотарев","Золотарёв","Золотов","Зорин","Зотов","Зубков","Зубов","Зуев","Зыков","Зюганов","Иванов","Ивашов","Игнатов","Игнатьев","Измайлов","Ильин","Ильинский","Ильюхин","Исаев","Исаков","Казаков","Казанцев","Калачев","Калачёв","Калашников","Калинин"
]

let female=[
    "Агафья" ,"Аглая" ,"Агния" ,"Агриппина" ,"Аза" ,"Акулина" ,"Алевтина" ,"Александра" ,"Алина" ,"Алла" ,"Анастасия" ,"Ангелина" ,"Анжела" ,"Анжелика" ,"Анна" ,"Антонина" ,"Анфиса" ,"Валентина" ,"Валерия" ,"Варвара" ,"Василиса" ,"Вера" ,"Вероника" ,"Виктория" ,"Галина" ,"Глафира" ,"Гликерия" ,"Дана" ,"Дарья" ,"Евгения" ,"Евдокия" ,"Евлалия" ,"Евлампия" ,"Евпраксия" ,"Евфросиния" ,"Екатерина" ,"Елена" ,"Елизавета" ,"Епистима" ,"Ермиония" ,"Жанна" ,"Зинаида" ,"Злата" ,"Зоя" ,"Инга" ,"Инесса" ,"Инна" ,"Иоанна" ,"Ираида" ,"Ирина" ,"Капитолина" ,"Карина" ,"Каролина" ,"Кира" ,"Клавдия" ,"Ксения" ,"Лада" ,"Лариса" ,"Лидия" ,"Лилия" ,"Любовь" ,"Людмила" ,"Маргарита" ,"Марина" ,"Мария" ,"Марфа" ,"Матрёна" ,"Милица" ,"Мирослава" ,"Надежда" ,"Наталья" ,"Нина" ,"Нонна" ,"Оксана" ,"Октябрина" ,"Олимпиада" ,"Ольга" ,"Павлина" ,"Пелагея" ,"Полина" ,"Прасковья" ,"Рада" ,"Регина" ,"Римма" ,"Рогнеда" ,"Светлана" ,"Серафима" ,"Снежана" ,"София" ,"Таисия" ,"Тамара" ,"Татьяна" ,"Улита" ,"Ульяна" ,"Урсула" ,"Фаина" ,"Феврония" ,"Фёкла" ,"Феодора" ,"Целестина" ,"Юлия" ,"Яна" ,"Ярослава"
]


  












function Replacer(){
	let list = [];
	for (let i = 0 ; i < female.length; i++) {
		list[i] = `<firstname tags="female" value="` + female[i] + `" />`;	
	}
	for (let i = 0 ; i < list.length; i++) {
        console.log(list[i])
    }
}

Replacer()